# Id Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionInputPoint..::..Id Property
ConnectionInputPoint Class See Also
---
Unique id of this input point.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public Guid Id { get; set; }
```

Visual Basic
---
```text
Public Property Id As Guid
	Get
	Set
```

Visual C++
---
```text
public:
property Guid Id {
	Guid get ();
	void set (Guid value);
}
```

# See Also
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace